Revit 2024 API
MEPSystemType.CalculationLevel Property
 Identifies the calculation level for the system type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public SystemCalculationLevel CalculationLevel { get; set; }
Visual Basic
Public Property CalculationLevel As SystemCalculationLevel
	Get
	Set
Visual C++
public:
property SystemCalculationLevel CalculationLevel {
	SystemCalculationLevel get ();
	void set (SystemCalculationLevel value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace